In [1]:
import pandas as pd
import numpy as np
import os

In [2]:
work=os.getcwd()
work

'C:\\Users\\Tsymbal Group Member\\OneDrive - University of Nebraska-Lincoln\\data_camp\\Springbroad\\SpringBoard_Projects\\project_data'

In [5]:
country=pd.read_csv(work+'\\2012_0.csv',sep=',')
country=country[['country','year']]
country.head()

       country  year
0  Afghanistan  2012
1      Albania  2012
2      Algeria  2012
3       Angola  2012
4    Argentina  2012

In [46]:
child=pd.read_csv(work+'\\dataset\\data_child.csv',sep=',')
child.head()

,﻿country,1970,1990,2000,2005,2008,2009,2010,2011,2012,91.1
0,Afghanistan,307.8,181.0,137.0,119.6,110.4,107.6,105.0,102.3,99.5,14.0
1,Albania,NaN,40.6,26.2,20.5,17.9,17.3,16.6,16.0,15.5,25.5
2,Algeria,241.7,46.8,39.7,33.6,29.4,28.3,27.3,26.6,26.1,2.8
3,Andorra,NaN,8.5,4.6,3.9,3.5,3.4,3.3,3.2,3.1,156.9
4,Angola,NaN,226.0,216.7,203.9,192.0,187.3,182.5,177.3,172.2,8.1

In [47]:
child=child.rename(columns={'﻿country':'country'})

In [48]:
cd=child[['country','2012']]
cd.head()

       country   2012
0  Afghanistan   99.5
1      Albania   15.5
2      Algeria   26.1
3      Andorra    3.1
4       Angola  172.2

In [49]:
cdf=pd.merge(country, cd, on='country', how='left')
cdf

                  country  year   2012
0             Afghanistan  2012   99.5
1                 Albania  2012   15.5
2                 Algeria  2012   26.1
3                  Angola  2012  172.2
4               Argentina  2012   13.8
5                 Armenia  2012   16.3
6               Australia  2012    4.3
7                 Austria  2012    4.0
8              Azerbaijan  2012   35.7
9                 Bahrain  2012    7.3
10             Bangladesh  2012   44.0
11                Belarus  2012    5.3
12                Belgium  2012    4.3
13                  Benin  2012  107.0
14                Bolivia  2012   43.1
15   Bosnia & Herzegovina  2012    6.5
16               Botswana  2012   49.5
17                 Brazil  2012   16.0
18               Bulgaria  2012   12.0
19           Burkina Faso  2012  101.4
20               Cambodia  2012   35.8
21               Cameroon  2012   97.4
22                 Canada  2012    5.3
23                   Chad  2012  151.6
24                  Chile  2012    8.6
25                  China  2012   13.4
26               Colombia  2012   17.4
27                Comoros  2012   80.9
28    Congo - Brazzaville  2012   52.6
29       Congo - Kinshasa  2012  108.5
..                    ...   ...    ...
112              Slovenia  2012    3.0
113               Somalia  2012  150.6
114          South Africa  2012   47.7
115           South Korea  2012    3.8
116                 Spain  2012    4.4
117             Sri Lanka  2012   10.4
118           South Sudan  2012  102.8
119              Suriname  2012   23.4
120                Sweden  2012    3.0
121           Switzerland  2012    4.3
122                 Syria  2012   16.0
123                Taiwan  2012    NaN
124            Tajikistan  2012   49.3
125              Tanzania  2012   55.7
126              Thailand  2012   13.5
127               Tunisia  2012   15.8
128                Turkey  2012   16.5
129          Turkmenistan  2012   56.5
130                Uganda  2012   64.1
131               Ukraine  2012   10.6
132  United Arab Emirates  2012    7.8
133        United Kingdom  2012    4.8
134         United States  2012    7.1
135               Uruguay  2012   11.6
136            Uzbekistan  2012   43.2
137             Venezuela  2012   16.1
138               Vietnam  2012   23.5
139                 Yemen  2012   48.4
140                Zambia  2012   74.4
141              Zimbabwe  2012   78.5

[142 rows x 3 columns]

In [50]:
cdf.shape

(142, 3)

In [43]:
country.shape

(142, 2)

In [51]:
cdf.to_csv('2012_child.csv',sep=',')

## The second data cleaning: combining some other dataset

In [68]:
child=pd.read_csv(work+'\\2012_child.csv',sep=',')

In [69]:
child.drop('Unnamed: 0',axis=1, inplace=True)

In [72]:
child=child.rename(columns={'2012':'child'})
child.head()

       country  year  child
0  Afghanistan  2012   99.5
1      Albania  2012   15.5
2      Algeria  2012   26.1
3       Angola  2012  172.2
4    Argentina  2012   13.8

### public education

In [139]:
publicEdu=pd.read_csv(work+'\\dataset\data_publicEdu.csv',sep=',')

In [141]:
publicEdu=publicEdu.rename(columns={'﻿country':'country','2012':'publicEdu'})[['country','publicEdu']]
publicEdu.head()

       country  publicEdu
0  Afghanistan        3.1
1      Albania        NaN
2      Algeria        NaN
3      Andorra        NaN
4       Angola        NaN

In [80]:
publicEdu.head()

       country  publicEdu
0  Afghanistan        3.1
1      Albania        NaN
2      Algeria        NaN
3      Andorra        NaN
4       Angola        NaN

### Health Expenditure

In [81]:
healthExp=pd.read_csv(work+'\\dataset\\data_HealthExpenditure.csv',sep=',')

In [147]:
healthExp=healthExp.rename(columns={'﻿country':'country','2012':'healthExp'})[['country','healthExp']]
healthExp.head()

       country  healthExp
0  Afghanistan       58.0
1      Albania      240.0
2      Algeria      335.0
3      Andorra     2994.0
4       Angola      168.0

### Visitor

In [83]:
visitor=pd.read_csv(work+'\\dataset\\data_visitor.csv',sep=',')

In [84]:
visitor=visitor.rename(columns={'﻿country':'country','2012':'visitor'})[['country','visitor']]
visitor.head()

               country    visitor
0              Albania  3156000.0
1              Algeria  2634000.0
2              Andorra  2238000.0
3               Angola   528000.0
4  Antigua and Barbuda   247000.0

### Income

In [85]:
income=pd.read_csv(work+'\\dataset\\data_income.csv',sep=',')

In [86]:
income=income.rename(columns={'﻿country':'country','2012':'income'})[['country','income']]
income.head()

       country  income
0  Afghanistan     NaN
1      Albania  4245.0
2      Algeria  4532.0
3      Andorra     NaN
4       Angola     NaN

### Homicide

In [87]:
homicide=pd.read_csv(work+'\\dataset\\data_homicide.csv',sep=',')

In [88]:
homicide=homicide.rename(columns={'﻿country':'country','2012':'homicide'})[['country','homicide']]
homicide.head()

       country  homicide
0  Afghanistan       6.6
1      Albania       5.5
2      Algeria       1.3
3      Andorra       0.0
4       Angola       9.8

### EcoFree

In [96]:
ecoFree=pd.read_csv(work+'\\dataset\\data_ecoFree.csv',sep=',')

In [97]:
ecoFree=ecoFree.rename(columns={'﻿country':'country','2012':'ecoFree'})[['country','ecoFree']]
ecoFree.head()

     country  ecoFree
0    Albania     65.1
1    Algeria     51.0
2     Angola     46.7
3  Argentina     48.0
4    Armenia     68.8

### UniEnro

In [98]:
uniEnro=pd.read_csv(work+'\\dataset\\data_uniEnro.csv',sep=',')

In [99]:
uniEnro=uniEnro.rename(columns={'﻿country':'country','2012':'uniEnro'})[['country','uniEnro']]
uniEnro.head()

               country  uniEnro
0          Afghanistan      NaN
1              Albania     58.6
2              Algeria     32.2
3               Angola      NaN
4  Antigua and Barbuda     23.5

### aveVis

In [123]:
aveVis=pd.read_csv(work+'\\dataset\\data_aveVis.csv',sep=',')

In [124]:
aveVis=aveVis.rename(columns={'﻿country':'country','2012':'aveVis'})[['country','aveVis']]
aveVis.head()

       country   aveVis
0  Afghanistan   652860
1      Albania    27400
2      Algeria  2381740
3      Andorra      470
4       Angola  1246700

### Merge all of them!!

In [150]:
d1=pd.merge(healthExp,publicEdu,on='country',how='outer')
d1.head()

       country  healthExp  publicEdu
0  Afghanistan       58.0        3.1
1      Albania      240.0        NaN
2      Algeria      335.0        NaN
3      Andorra     2994.0        NaN
4       Angola      168.0        NaN

In [151]:
d2=pd.merge(d1,visitor,on='country',how='outer')
d2.head()

       country  healthExp  publicEdu    visitor
0  Afghanistan       58.0        3.1        NaN
1      Albania      240.0        NaN  3156000.0
2      Algeria      335.0        NaN  2634000.0
3      Andorra     2994.0        NaN  2238000.0
4       Angola      168.0        NaN   528000.0

In [152]:
d3=pd.merge(d2,income,on='country',how='outer')
d3.head()

       country  healthExp  publicEdu    visitor  income
0  Afghanistan       58.0        3.1        NaN     NaN
1      Albania      240.0        NaN  3156000.0  4245.0
2      Algeria      335.0        NaN  2634000.0  4532.0
3      Andorra     2994.0        NaN  2238000.0     NaN
4       Angola      168.0        NaN   528000.0     NaN

In [153]:
d4=pd.merge(d3,homicide,on='country',how='outer')
d4.head()

       country  healthExp  publicEdu    visitor  income  homicide
0  Afghanistan       58.0        3.1        NaN     NaN       6.6
1      Albania      240.0        NaN  3156000.0  4245.0       5.5
2      Algeria      335.0        NaN  2634000.0  4532.0       1.3
3      Andorra     2994.0        NaN  2238000.0     NaN       0.0
4       Angola      168.0        NaN   528000.0     NaN       9.8

In [154]:
d5=pd.merge(d4,ecoFree,on='country',how='outer')
d5.head()

       country  healthExp  publicEdu    visitor  income  homicide  ecoFree
0  Afghanistan       58.0        3.1        NaN     NaN       6.6      NaN
1      Albania      240.0        NaN  3156000.0  4245.0       5.5     65.1
2      Algeria      335.0        NaN  2634000.0  4532.0       1.3     51.0
3      Andorra     2994.0        NaN  2238000.0     NaN       0.0      NaN
4       Angola      168.0        NaN   528000.0     NaN       9.8     46.7

In [155]:
d6=pd.merge(d5,uniEnro,on='country',how='outer')
d6.head()

,country,healthExp,publicEdu,visitor,income,homicide,ecoFree,uniEnro
0,Afghanistan,58.0,3.1,NaN,NaN,6.6,NaN,NaN
1,Albania,240.0,NaN,3156000.0,4245.0,5.5,65.1,58.6
2,Algeria,335.0,NaN,2634000.0,4532.0,1.3,51.0,32.2
3,Andorra,2994.0,NaN,2238000.0,NaN,0.0,NaN,NaN
4,Angola,168.0,NaN,528000.0,NaN,9.8,46.7,NaN

In [156]:
d7=pd.merge(d6,aveVis,on='country',how='outer')
d7.head()

,country,healthExp,publicEdu,visitor,income,homicide,ecoFree,uniEnro,aveVis
0,Afghanistan,58.0,3.1,NaN,NaN,6.6,NaN,NaN,652860.0
1,Albania,240.0,NaN,3156000.0,4245.0,5.5,65.1,58.6,27400.0
2,Algeria,335.0,NaN,2634000.0,4532.0,1.3,51.0,32.2,2381740.0
3,Andorra,2994.0,NaN,2238000.0,NaN,0.0,NaN,NaN,470.0
4,Angola,168.0,NaN,528000.0,NaN,9.8,46.7,NaN,1246700.0

In [157]:
d7.shape

(240, 9)

In [158]:
d7.to_csv('d7.csv',sep=',')

### Combine new data

In [159]:
df7=pd.read_csv('d7.csv',sep=',')

In [164]:
df7=df7.drop('Unnamed: 0',1)

In [165]:
d8=pd.merge(child,df7,on='country',how='left')

In [166]:
d8.head()

,country,year,child,healthExp,publicEdu,visitor,income,homicide,ecoFree,uniEnro,aveVis
0,Afghanistan,2012,99.5,58.0,3.1,NaN,NaN,6.6,NaN,NaN,652860.0
1,Albania,2012,15.5,240.0,NaN,3156000.0,4245.0,5.5,65.1,58.6,27400.0
2,Algeria,2012,26.1,335.0,NaN,2634000.0,4532.0,1.3,51.0,32.2,2381740.0
3,Angola,2012,172.2,168.0,NaN,528000.0,NaN,9.8,46.7,NaN,1246700.0
4,Argentina,2012,13.8,727.0,5.1,5587000.0,10391.0,NaN,48.0,79.0,2736690.0

In [167]:
d8.shape

(144, 11)

In [168]:
d8.to_csv('d8.csv',sep=',')

## Alcohol Data

In [176]:
alcohol=pd.read_csv(work+'\\dataset\\data_alcohol.csv',sep=',')

In [183]:
alcohol=alcohol[['﻿Country','Beverage Types','2012']].rename(columns={'﻿Country':'country'})

In [184]:
alcohol.head()

       country              Beverage Types  2012
0  Afghanistan                   All types  0.01
1  Afghanistan                        Beer  0.01
2  Afghanistan                        Wine  0.00
3  Afghanistan                     Spirits  0.00
4  Afghanistan   Other alcoholic beverages  0.00

In [195]:
alcohol=alcohol[alcohol['Beverage Types'].str.contains('All types')]

In [196]:
alcohol.shape

(196, 3)

In [197]:
alcohol.to_csv('alcohol.csv',sep=',')

In [203]:
dfa=pd.read_csv('alcohol.csv',sep=',')

In [205]:
dfa=dfa.drop('Unnamed: 0',1).rename(columns={'2012':'alcohol'})

In [206]:
dfa.head()

       country Beverage Types  alcohol
0  Afghanistan      All types     0.01
1      Albania      All types     5.14
2      Algeria      All types     0.66
3      Andorra      All types    10.28
4       Angola      All types     8.24

In [209]:
d9a=pd.read_csv('d8.csv',sep=',')

In [210]:
d9=pd.merge(d9a,dfa,on='country',how='left')

In [211]:
d9.shape

(143, 14)

In [212]:
d9.to_csv('d9.csv',sep=',')

### Unemployment

In [223]:
unemploy=pd.read_csv(work+'\\dataset\\data_umemploy.csv',sep=',')

In [224]:
unemploy=unemploy.rename(columns={'﻿country':'country','2012':'umemploy'})
unemploy=unemploy[['country','umemploy']]

In [218]:
unemploy.head()

          country     umemploy
0     Afghanistan          8.5
1         Albania  13.89999962
2         Algeria           11
3  American Samoa           ..
4         Andorra           ..

In [225]:
d9a=pd.read_csv('d9.csv',sep=',')

In [226]:
d10=pd.merge(d9a,unemploy,on='country',how='left')

In [227]:
d10.to_csv('d10.csv',sep=',')

### Final dataset

In [228]:
data0=pd.read_csv('2012_0.csv',sep=',')
data1=pd.read_csv('d10.csv',sep=',')

In [229]:
dataframe=pd.merge(data0,data1,on='country',how='left')

In [230]:
dataframe.head()

,country,year,Life Ladder,Log GDP per capita,Confidence in national government,Social support,Healthy life expectancy at birth,Generosity,"GINI index (World Bank estimate), average 2000-13",child,healthExp,publicEdu,visitor,income,homicide,ecoFree,uniEnro,aveVis,alcohol,umemploy
0,Afghanistan,2012,3.782938,7.549241,0.435440,0.520637,48.738346,0.247900,NaN,99.5,58.0,3.1,NaN,NaN,6.6,NaN,NaN,652860.0,0.01,8.5
1,Albania,2012,5.510124,9.189268,0.364894,0.784502,67.942978,-0.169465,0.305000,15.5,240.0,NaN,3156000.0,4245.0,5.5,65.1,58.6,27400.0,5.14,13.89999962
2,Algeria,2012,5.604596,9.487703,NaN,0.839397,64.001305,-0.198894,NaN,26.1,335.0,NaN,2634000.0,4532.0,1.3,51.0,32.2,2381740.0,0.66,11
3,Angola,2012,4.360250,8.886378,0.237091,0.752593,44.400314,-0.138073,0.473400,172.2,168.0,NaN,528000.0,NaN,9.8,46.7,NaN,1246700.0,8.24,6.900000095
4,Argentina,2012,6.468387,NaN,0.418255,0.901776,66.838005,NaN,0.479421,13.8,727.0,5.1,5587000.0,10391.0,NaN,48.0,79.0,2736690.0,8.35,7.199999809

In [231]:
dataframe.to_csv('dataframe.csv',sep=',')

## Dealing with missing data

In [24]:
df=pd.read_csv('dataframe.csv',sep=',')

In [4]:
df.columns

Index([u'Unnamed: 0', u'country', u'year', u'Life Ladder',
       u'Log GDP per capita', u'Confidence in national government',
       u'Social support', u'Healthy life expectancy at birth', u'Generosity',
       u'GINI index (World Bank estimate), average 2000-13', u'child',
       u'healthExp', u'publicEdu', u'visitor', u'income', u'homicide',
       u'ecoFree', u'uniEnro', u'aveVis', u'alcohol', u'umemploy'],
      dtype='object')

In [7]:
df[df['Log GDP per capita'].isnull()]['country']

4            Argentina
87     Myanmar (Burma)
94        North Cyprus
113            Somalia
123             Taiwan
Name: country, dtype: object

In [9]:
df[df['child'].isnull()]['country']

52         Hong Kong SAR China
95     Palestinian Territories
121                     Taiwan
Name: country, dtype: object

In [11]:
df[df['healthExp'].isnull()]['country']

52         Hong Kong SAR China
74                   Macedonia
95     Palestinian Territories
111                    Somalia
121                     Taiwan
Name: country, dtype: object

In [15]:
df[df['publicEdu'].isnull()]['country']

15        Bosnia & Herzegovina
25                       China
50                       Haiti
58                        Iraq
71                       Libya
74                   Macedonia
84                  Montenegro
86             Myanmar (Burma)
92                     Nigeria
95     Palestinian Territories
117                   Suriname
121                     Taiwan
130       United Arab Emirates
134                 Uzbekistan
Name: country, dtype: object

In [17]:
df[df['visitor'].isnull()]['country']

27                     Comoros
43                       Gabon
52         Hong Kong SAR China
71                       Libya
80                  Mauritania
95     Palestinian Territories
111                    Somalia
116                South Sudan
120                      Syria
121                     Taiwan
127               Turkmenistan
130       United Arab Emirates
134                 Uzbekistan
Name: country, dtype: object

In [21]:
df[df['income'].isnull()]['country']

95     Palestinian Territories
111                    Somalia
120                      Syria
Name: country, dtype: object

In [25]:
df[df['ecoFree'].isnull()]['country']

0              Afghanistan
52     Hong Kong SAR China
58                    Iraq
86         Myanmar (Burma)
110                Somalia
115            South Sudan
119                  Syria
Name: country, dtype: object